app/controllers/articles_controller.rb

  def redirect
    from = extract_feed_format(params[:from])
    factory = Article::Factory.new(this_blog, current_user)

    @article = factory.match_permalink_format(from, this_blog.permalink_format)
    return show_article if @article

    # Redirect old version with /:year/:month/:day/:title to new format,
    # because it's changed
    ["%year%/%month%/%day%/%title%", "articles/%year%/%month%/%day%/%title%"].each do |part|
      @article = factory.match_permalink_format(from, part)
      return redirect_to @article.permalink_url, status: 301 if @article
    end

    r = Redirect.find_by_from_path(from)
---
SELECT "redirects".* FROM "redirects" WHERE "redirects"."from_path" = 'stylesheets/user-style.css' LIMIT 1